{
  "format": "graph-model",
  "generatedBy": "https://github.com/dlunion/DBFace",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "inputs": {"name":"inputs:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"320"},{"size":"320"},{"size":"3"}]}}
      },
      "outputs":
      {
          "Identity": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"80"},{"size":"80"},{"size":"10"}]}},
          "Identity_2": {"name":"Identity_2:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"80"},{"size":"80"},{"size":"1"}]}},
          "Identity_1": {"name":"Identity_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"80"},{"size":"80"},{"size":"4"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"model/zero_padding2d_18/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/conv2d_44/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},
          {"name":"model/tf.math.add_62/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model/conv2d_45/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"10"}]}}}}},
          {"name":"model/tf.math.add_63/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}}}},
          {"name":"model/zero_padding2d_19/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_46/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},
          {"name":"model/tf.math.add_64/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_47/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"4"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_65/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"4"}]}}}}},
          {"name":"model/zero_padding2d_13/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_39/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_57/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_15/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/conv2d_41/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"model/tf.math.add_59/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_28/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"288"}]}}}}},
          {"name":"model/tf.math.add_42/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model/zero_padding2d_9/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d_8/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_43/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_29/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"96"}]}}}}},
          {"name":"model/tf.math.add_44/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"model/tf.math.reduce_mean_5/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_30/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"24"}]}}}}},
          {"name":"model/tf.math.add_45/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_31/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"96"}]}}}}},
          {"name":"model/tf.math.add_46/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_32/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_47/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model/lambda/ResizeBilinear/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"model/zero_padding2d_10/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/conv2d_33/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_48/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_24/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_36/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"model/zero_padding2d_8/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/depthwise_conv2d_7/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"144"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_37/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"model/conv2d_25/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"48"}]}}}}},
          {"name":"model/tf.math.add_38/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"model/tf.math.reduce_mean_4/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_26/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"12"}]}}}}},
          {"name":"model/tf.math.add_39/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"12"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_27/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"12"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_40/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"model/conv2d_19/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"120"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_29/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"120"}]}}}}},
          {"name":"model/zero_padding2d_7/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/depthwise_conv2d_6/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"120"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_30/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"120"}]}}}}},
          {"name":"model/conv2d_20/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"120"},{"size":"48"}]}}}}},
          {"name":"model/tf.math.add_31/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.reduce_mean_3/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"model/conv2d_21/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"12"}]}}}}},
          {"name":"model/tf.math.add_32/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"12"}]}}}}},
          {"name":"model/conv2d_22/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"12"},{"size":"48"}]}}}}},
          {"name":"model/tf.math.add_33/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_15/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_23/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}}}},
          {"name":"model/zero_padding2d_6/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d_5/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"240"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_24/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}}}},
          {"name":"model/conv2d_16/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"240"},{"size":"40"}]}}}}},
          {"name":"model/tf.math.add_25/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}}}},
          {"name":"model/tf.math.reduce_mean_2/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_17/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"10"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_26/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}}}},
          {"name":"model/conv2d_18/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"10"},{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_27/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}}}},
          {"name":"model/conv2d_11/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_17/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}}}},
          {"name":"model/zero_padding2d_5/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d_4/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"240"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_18/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_12/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"240"},{"size":"40"}]}}}}},
          {"name":"model/tf.math.add_19/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}}}},
          {"name":"model/tf.math.reduce_mean_1/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_13/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"10"}]}}}}},
          {"name":"model/tf.math.add_20/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_14/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"10"},{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_21/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_7/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"96"}]}}}}},
          {"name":"model/tf.math.add_12/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_4/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/depthwise_conv2d_3/depthwise/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"model/tf.math.add_13/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"model/conv2d_8/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_14/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.reduce_mean/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_9/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"10"}]}}}}},
          {"name":"model/tf.math.add_15/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}}}},
          {"name":"model/conv2d_10/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"10"},{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_16/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_23/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_34/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_34/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"64"}]}}}}},
          {"name":"model/tf.math.add_49/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model/lambda_1/ResizeBilinear/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"model/zero_padding2d_11/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/conv2d_35/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},
          {"name":"model/tf.math.add_51/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_5/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"88"}]}}}}},
          {"name":"model/tf.math.add_8/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}}}},
          {"name":"model/zero_padding2d_3/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d_2/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"88"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_9/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_6/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"88"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_10/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_3/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"72"}]}}}}},
          {"name":"model/tf.math.add_5/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}}}},
          {"name":"model/zero_padding2d_2/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d_1/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"72"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_6/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"72"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_4/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"72"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_7/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"model/conv2d_36/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_52/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/lambda_2/ResizeBilinear/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"model/zero_padding2d_12/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model/conv2d_37/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},
          {"name":"model/tf.math.add_54/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model/tf.math.multiply/Mul/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1"},{"size":"3"}]}}}}},
          {"name":"model/tf.math.add/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_1/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"model/conv2d_1/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"model/tf.math.add_2/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"model/zero_padding2d_1/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_3/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_2/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_4/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_38/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_55/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model/zero_padding2d_14/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_40/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_58/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"model/zero_padding2d_16/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_42/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_60/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"model/zero_padding2d_17/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_43/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"16"}]}}}}},
          {"name":"model/tf.math.add_61/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.concat/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/zero_padding2d_20/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model/conv2d_48/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},
          {"name":"model/tf.math.add_66/Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model/conv2d_49/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_67/Add/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"inputs","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"1"},{"size":"320"},{"size":"320"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.multiply/Mul","op":"Mul","input":["inputs","model/tf.math.multiply/Mul/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add/Add","op":"Add","input":["model/tf.math.multiply/Mul","model/tf.math.add/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d/Pad","op":"Pad","input":["model/tf.math.add/Add","model/zero_padding2d/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d/Conv2D","op":"Conv2D","input":["model/zero_padding2d/Pad","model/conv2d/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_1/Add","op":"Add","input":["model/conv2d/Conv2D","model/tf.math.add_1/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu/Relu","op":"Relu","input":["model/tf.math.add_1/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_1/Conv2D","op":"Conv2D","input":["model/tf.nn.relu/Relu","model/conv2d_1/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"model/tf.math.add_2/Add","op":"Add","input":["model/conv2d_1/Conv2D","model/tf.math.add_2/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_1/Relu","op":"Relu","input":["model/tf.math.add_2/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_1/Pad","op":"Pad","input":["model/tf.nn.relu_1/Relu","model/zero_padding2d_1/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d/depthwise","op":"DepthwiseConv2dNative","input":["model/zero_padding2d_1/Pad","model/depthwise_conv2d/depthwise/ReadVariableOp"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="}}},
          {"name":"model/tf.math.add_3/Add","op":"Add","input":["model/depthwise_conv2d/depthwise","model/tf.math.add_3/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_2/Relu","op":"Relu","input":["model/tf.math.add_3/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_2/Conv2D","op":"Conv2D","input":["model/tf.nn.relu_2/Relu","model/conv2d_2/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model/tf.math.add_4/Add","op":"Add","input":["model/conv2d_2/Conv2D","model/tf.math.add_4/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_3/Conv2D","op":"Conv2D","input":["model/tf.math.add_4/Add","model/conv2d_3/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model/conv2d_38/Conv2D","op":"Conv2D","input":["model/tf.math.add_4/Add","model/conv2d_38/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_5/Add","op":"Add","input":["model/conv2d_3/Conv2D","model/tf.math.add_5/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_55/Add","op":"Add","input":["model/conv2d_38/Conv2D","model/tf.math.add_55/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_3/Relu","op":"Relu","input":["model/tf.math.add_5/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_31/Relu","op":"Relu","input":["model/tf.math.add_55/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_2/Pad","op":"Pad","input":["model/tf.nn.relu_3/Relu","model/zero_padding2d_2/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/depthwise_conv2d_1/depthwise","op":"DepthwiseConv2dNative","input":["model/zero_padding2d_2/Pad","model/depthwise_conv2d_1/depthwise/ReadVariableOp"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"model/tf.math.add_6/Add","op":"Add","input":["model/depthwise_conv2d_1/depthwise","model/tf.math.add_6/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_4/Relu","op":"Relu","input":["model/tf.math.add_6/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_4/Conv2D","op":"Conv2D","input":["model/tf.nn.relu_4/Relu","model/conv2d_4/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"model/tf.math.add_7/Add","op":"Add","input":["model/conv2d_4/Conv2D","model/tf.math.add_7/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_5/Conv2D","op":"Conv2D","input":["model/tf.math.add_7/Add","model/conv2d_5/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"model/tf.math.add_8/Add","op":"Add","input":["model/conv2d_5/Conv2D","model/tf.math.add_8/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_5/Relu","op":"Relu","input":["model/tf.math.add_8/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_3/Pad","op":"Pad","input":["model/tf.nn.relu_5/Relu","model/zero_padding2d_3/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/depthwise_conv2d_2/depthwise","op":"DepthwiseConv2dNative","input":["model/zero_padding2d_3/Pad","model/depthwise_conv2d_2/depthwise/ReadVariableOp"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"model/tf.math.add_9/Add","op":"Add","input":["model/depthwise_conv2d_2/depthwise","model/tf.math.add_9/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_6/Relu","op":"Relu","input":["model/tf.math.add_9/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_6/Conv2D","op":"Conv2D","input":["model/tf.nn.relu_6/Relu","model/conv2d_6/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model/tf.math.add_10/Add","op":"Add","input":["model/conv2d_6/Conv2D","model/tf.math.add_10/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_11/Add","op":"Add","input":["model/tf.math.add_10/Add","model/tf.math.add_7/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_7/Conv2D","op":"Conv2D","input":["model/tf.math.add_11/Add","model/conv2d_7/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"model/conv2d_36/Conv2D","op":"Conv2D","input":["model/tf.math.add_11/Add","model/conv2d_36/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model/tf.math.add_12/Add","op":"Add","input":["model/conv2d_7/Conv2D","model/tf.math.add_12/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_52/Add","op":"Add","input":["model/conv2d_36/Conv2D","model/tf.math.add_52/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_7/Relu","op":"Relu","input":["model/tf.math.add_12/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_29/Relu","op":"Relu","input":["model/tf.math.add_52/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_4/Pad","op":"Pad","input":["model/tf.nn.relu_7/Relu","model/zero_padding2d_4/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/depthwise_conv2d_3/depthwise","op":"DepthwiseConv2dNative","input":["model/zero_padding2d_4/Pad","model/depthwise_conv2d_3/depthwise/ReadVariableOp"],"attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","2","2","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"model/tf.math.add_13/Add","op":"Add","input":["model/depthwise_conv2d_3/depthwise","model/tf.math.add_13/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_8/Relu","op":"Relu","input":["model/tf.math.add_13/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_8/Conv2D","op":"Conv2D","input":["model/tf.nn.relu_8/Relu","model/conv2d_8/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_14/Add","op":"Add","input":["model/conv2d_8/Conv2D","model/tf.math.add_14/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.reduce_mean/Mean","op":"Mean","input":["model/tf.math.add_14/Add","model/tf.math.reduce_mean/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_9/Conv2D","op":"Conv2D","input":["model/tf.math.reduce_mean/Mean","model/conv2d_9/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"model/tf.math.add_15/Add","op":"Add","input":["model/conv2d_9/Conv2D","model/tf.math.add_15/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_9/Relu","op":"Relu","input":["model/tf.math.add_15/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_10/Conv2D","op":"Conv2D","input":["model/tf.nn.relu_9/Relu","model/conv2d_10/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model/tf.math.add_16/Add","op":"Add","input":["model/conv2d_10/Conv2D","model/tf.math.add_16/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.sigmoid/Sigmoid","op":"Sigmoid","input":["model/tf.math.add_16/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.multiply_1/Mul","op":"Mul","input":["model/tf.math.add_14/Add","model/tf.math.sigmoid/Sigmoid"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_11/Conv2D","op":"Conv2D","input":["model/tf.math.multiply_1/Mul","model/conv2d_11/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="}}},
          {"name":"model/tf.math.add_17/Add","op":"Add","input":["model/conv2d_11/Conv2D","model/tf.math.add_17/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_10/Relu","op":"Relu","input":["model/tf.math.add_17/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_5/Pad","op":"Pad","input":["model/tf.nn.relu_10/Relu","model/zero_padding2d_5/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d_4/depthwise","op":"DepthwiseConv2dNative","input":["model/zero_padding2d_5/Pad","model/depthwise_conv2d_4/depthwise/ReadVariableOp"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"model/tf.math.add_18/Add","op":"Add","input":["model/depthwise_conv2d_4/depthwise","model/tf.math.add_18/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_11/Relu","op":"Relu","input":["model/tf.math.add_18/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_12/Conv2D","op":"Conv2D","input":["model/tf.nn.relu_11/Relu","model/conv2d_12/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model/tf.math.add_19/Add","op":"Add","input":["model/conv2d_12/Conv2D","model/tf.math.add_19/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.reduce_mean_1/Mean","op":"Mean","input":["model/tf.math.add_19/Add","model/tf.math.reduce_mean_1/Mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_13/Conv2D","op":"Conv2D","input":["model/tf.math.reduce_mean_1/Mean","model/conv2d_13/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="}}},
          {"name":"model/tf.math.add_20/Add","op":"Add","input":["model/conv2d_13/Conv2D","model/tf.math.add_20/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_12/Relu","op":"Relu","input":["model/tf.math.add_20/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_14/Conv2D","op":"Conv2D","input":["model/tf.nn.relu_12/Relu","model/conv2d_14/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}}}},
          {"name":"model/tf.math.add_21/Add","op":"Add","input":["model/conv2d_14/Conv2D","model/tf.math.add_21/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.sigmoid_1/Sigmoid","op":"Sigmoid","input":["model/tf.math.add_21/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.multiply_2/Mul","op":"Mul","input":["model/tf.math.add_19/Add","model/tf.math.sigmoid_1/Sigmoid"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_22/Add","op":"Add","input":["model/tf.math.multiply_2/Mul","model/tf.math.multiply_1/Mul"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/conv2d_15/Conv2D","op":"Conv2D","input":["model/tf.math.add_22/Add","model/conv2d_15/Conv2D/ReadVariableOp"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.math.add_23/Add","op":"Add","input":["model/conv2d_15/Conv2D","model/tf.math.add_23/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/tf.nn.relu_13/Relu","op":"Relu","input":["model/tf.math.add_23/Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model/zero_padding2d_6/Pad","op":"Pad","input":["model/tf.nn.relu_13/Relu","model/zero_padding2d_6/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"model/depthwise_conv2d_5/depthwise","op":"DepthwiseConv2dNative","input":["model/zero_padding2d_6/Pad","model/depthwise_conv2d_5/depthwise/ReadVariableOp"],"attr":{"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model/tf.math.add_24/Add","op":"Add","input":["model/depthwise_conv2d_5/depthwise","model/tf.math.add_24/Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
